/*
 * Copyright (c) 2019 eliboa
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms and conditions of the GNU General Public License,
 * version 2, as published by the Free Software Foundation.
 *
 * This program is distributed in the hope it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
 
#ifndef FAT32_H
#define FAT32_H

#include "utils.h"
#include "types.h"
#include <vector> 

using namespace std;

namespace fat32 {

    typedef struct _boot_sector {
        u8 dos[0xB]; 
        u8 bytes_per_sector[2]; // 0xB
        u8 sectors_per_cluster; // 0xD
        u16 reserved_sector_count; // 0xE
        u8 num_fats; // 0x10
        u8 _zeroFat32_1[4]; // 0x14
        u8 media_desc; // 0x15
        u8 _zeroFat32_2[2]; // 0x17
        u16 sectors_per_track; // 0x18
        u16 heads_for_disk; // 0x1A
        u32 hidden_sectors_count; // 0x1C
        u32 sectors_count; // 0x20
        u32 fat_size; // 0x24
        u16 drive_desc; // 0x28
        u16 version; // 0x2A
        u32 rootdir_cluster_num; // 0x2C
        u16 info_sector; // 0x30
        u16 bs_first_copy_sector; // 0x32
        u8 reserved[19]; // 0x34
        u8 label[11]; // 0x47
        u8 fs_type[8]; //0x52
    } boot_sector;

    // FAT32 structures
    typedef struct fs_attr fs_attr;
    struct fs_attr {
        unsigned short bytes_per_sector;
        unsigned char sectors_per_cluster;
        unsigned char num_fats;
        unsigned short reserved_sector_count;
        unsigned int fat_size;
        unsigned int sectors_count;
        unsigned short info_sector;
        char label[11];
    };

    typedef struct entry {
        char filename[11];
        unsigned char attributes;
        unsigned char reserved;
        unsigned char creation_ms;
        unsigned short creation_time;
        unsigned short creation_date;
        unsigned short last_access_time;
        unsigned short cluster_hi;
        unsigned short modified_time;
        unsigned short modified_date;
        unsigned short first_cluster;
        unsigned int file_size;
    } entry;

    typedef struct LFNentry {
        BYTE sequenceNo;
        BYTE fileName_Part1[10];
        BYTE fileattribute;
        BYTE reserved_1;
        BYTE checksum;
        BYTE fileName_Part2[12];
        BYTE FstClusLO[2];
        BYTE fileName_Part3[4];
    }LFN;

    typedef struct dir_entry dir_entry;
    struct dir_entry {
        std::string filename;
        bool is_directory = false;
        u64 data_offset;
        entry entry;
    };

    void read_boot_sector(BYTE *cluster, fs_attr *fat32_attr);
    void parse_dir_table(BYTE *cluster, std::vector<dir_entry> *entries);
    std::string get_long_filename(BYTE *buffer, int offset, int length);
    u32 getFatSize(u32 vol_size_in_sectors);


    static u8 fat32_default_boot_sector[90] = {
    0xEB, 0x58, 0x90, 0x50, 0x4B, 0x57, 0x49, 0x4E, 0x34, 0x2E, 0x31, 0x00,
    0x02, 0x40, 0x20, 0x00, 0x02, 0x00, 0x00, 0x00, 0x00, 0xF8, 0x00, 0x00,
    0x3F, 0x00, 0xFF, 0x00, 0xB8, 0x42, 0x7B, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0x00, 0x00, 0x00,
    0x01, 0x00, 0x06, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0x00, 0x00, 0x00, 0x00, 0x80, 0x00, 0x29, 0x0F, 0x15, 0x0B, 0x0D, 0x53,
    0x57, 0x49, 0x54, 0x43, 0x48, 0x00, 0x00, 0x00, 0x00, 0x00, 0x46, 0x41,
    0x54, 0x33, 0x32, 0x20, 0x20, 0x20 };


    static u8 fat32_default_info_sector[512] = {
        0x52, 0x52, 0x61, 0x41, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x72, 0x72, 0x41, 0x61, 0x0C, 0xCE, 0x1B, 0x00,
        0x03, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
        0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x55, 0xAA };

}
#endif
